app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def show
    id = params['id']
    @movie = Movie.find(id)

INSERT INTO "movies" ("title", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Harry Potter"], ["description", "dasdasd"], ["release_date", 2008-07-06 00:00:00 UTC], ["created_at", 2017-01-26 23:04:35 UTC], ["updated_at", 2017-01-26 23:04:35 UTC]]
---
  def create
    @movie = Movie.new(movie_params)
    if @movie.save

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    id = params['id']
    @movie = Movie.find(id)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "title" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Jady e Alef"], ["release_date", 2015-04-14 00:00:00 UTC], ["updated_at", 2017-01-26 23:27:43 UTC], ["id", 13]]
---
  def update
    id = params['id']
    @movie = Movie.find(id)
    @movie.update(movie_params)